app/controllers/studentrecs_controller.rb

  def index
    @studentrecs = Studentrec.all
---
SELECT "studentrecs".* FROM "studentrecs"

  def show
    @studentrec = Studentrec.find(params[:id])
---
SELECT "studentrecs".* FROM "studentrecs" WHERE "studentrecs"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @studentrec = Studentrec.new(params[:studentrec])

    respond_to do |format|
      if @studentrec.save
---
INSERT INTO "studentrecs" ("address", "birthday", "created_at", "gender", "group", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)